Documents/Производство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>Производство</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОстаткиКЗ</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СкладСписанияСырья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоступленияПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемоеКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическиВыпущено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляМасла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРозлива</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписыватьКЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОтправкиОтчетаПоУКЗ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусОтправкиОтчетаПоУКЗ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СырьеИМатериалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратныеОтходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВыхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакИзменения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрольныеЗнаки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>3</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальныйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечныйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаСписания</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДвижениеКонтрольныхЗнаков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроизводства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаВыпуска</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВыпуска</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОстаткиКЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОстаткиКЗ</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДвижениеКонтрольныхЗнаков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Продукция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПартии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Основной</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Основной.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Основной.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ДвижениеКонтрольныхЗнаков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ДвижениеКонтрольныхЗнаков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИспользованоПоНазначению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ликвидация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утеря</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уничтожение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хищение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Порча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводственныйБрак</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПредписанию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сырье</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полуфабрикаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начато</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Окончено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Производство/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Функция ОбработкаСуммыКоличества(Ссылка)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ПроизводствоЭтапыПроизводства.КоличествоВыпуска) КАК КоличествоВыпуска
		|ИЗ
		|	Документ.Производство.ЭтапыПроизводства КАК ПроизводствоЭтапыПроизводства
		|ГДЕ
		|	ПроизводствоЭтапыПроизводства.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка" , Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.КоличествоВыпуска = NULL Тогда
				Возврат 0;
			Иначе 
				Возврат ВыборкаДетальныеЗаписи.КоличествоВыпуска;
			КонецЕсли;
		КонецЦикла;
		
	КонецФункции
	
	
	Функция ПроверкаКоличестваКонтрольныхЗнаков(КонтрольныеЗнаки, СырьеИМатериалы)
		
		ЕстьКЗ = Ложь;
		КоличествоКЗ = 0;
		СправочникКонтрольЗнаки = Справочники.Номенклатура.НайтиПоНаименованию("Контрольные знаки").Ссылка;
		Для каждого Материал Из СырьеИМатериалы Цикл
			Если Материал.Номенклатура = СправочникКонтрольЗнаки Тогда
				ЕстьКЗ = Истина;
				КоличествоКЗ = КоличествоКЗ + Материал.Количество;
			КонецЕсли;
		КонецЦикла;
		Если Не ЕстьКЗ Тогда
			Возврат "Не содержит КЗ";
		КонецЕсли;
		Если КоличествоКЗ < КонтрольныеЗнаки.Итог("Количество") Тогда
			Возврат "Контрольных знаков внесено больше чем в материалах";
		ИначеЕсли КоличествоКЗ > КонтрольныеЗнаки.Итог("Количество") Тогда
			Возврат "Контрольных знаков внесено меньше чем в материалах";
		КонецЕсли; 
		
		Возврат "Всё ОК";
		
	КонецФункции // ПроверкаКоличестваКонтрольныхЗнаков()
	
	
	Функция ПроверкаНаличияКонтрольныхЗнаков(ТЗКонтрольныхЗнаков)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗКонтрольныхЗнаков.Номер КАК Номер,
		|	ТЗКонтрольныхЗнаков.Серия КАК Серия
		|ПОМЕСТИТЬ ТЗКонтрольныхЗнаков
		|ИЗ
		|	&ТЗКонтрольныхЗнаков КАК ТЗКонтрольныхЗнаков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиКЗСрезПоследних.Серия КАК Серия,
		|	ОстаткиКЗСрезПоследних.Номер КАК Номер,
		|	ОстаткиКЗСрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.ОстаткиКЗ.СрезПоследних(&ДатаСреза, ) КАК ОстаткиКЗСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗКонтрольныхЗнаков КАК ТЗКонтрольныхЗнаков
		|		ПО ОстаткиКЗСрезПоследних.Номер = ТЗКонтрольныхЗнаков.Номер
		|			И ОстаткиКЗСрезПоследних.Серия = ТЗКонтрольныхЗнаков.Серия";
		
		Запрос.УстановитьПараметр("ДатаСреза", Дата);
		Запрос.УстановитьПараметр("ТЗКонтрольныхЗнаков", ТЗКонтрольныхЗнаков);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		СчетчикНайденных = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СчетчикНайденных = СчетчикНайденных + 1;
		КонецЦикла;
		Возврат СчетчикНайденных;
		
	КонецФункции // ПроверкаНаличияКонтрольныхЗнаков()
	
	
	Функция ПроверкаПовторногоИспользованияКонтрольныхЗнаков(ТЗКонтрольныхЗнаков)
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗКонтрольныхЗнаков.Номер КАК Номер,
		|	ТЗКонтрольныхЗнаков.Серия КАК Серия
		|ПОМЕСТИТЬ ТЗКонтрольныхЗнаков
		|ИЗ
		|	&ТЗКонтрольныхЗнаков КАК ТЗКонтрольныхЗнаков
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиКЗСрезПоследних.Серия КАК Серия,
		|	ОстаткиКЗСрезПоследних.Номер КАК Номер,
		|	ОстаткиКЗСрезПоследних.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.ОстаткиКЗ.СрезПоследних(&ДатаСреза, ) КАК ОстаткиКЗСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТЗКонтрольныхЗнаков КАК ТЗКонтрольныхЗнаков
		|		ПО ОстаткиКЗСрезПоследних.Номер = ТЗКонтрольныхЗнаков.Номер
		|			И ОстаткиКЗСрезПоследних.Серия = ТЗКонтрольныхЗнаков.Серия
		|ГДЕ
		|	ОстаткиКЗСрезПоследних.Состояние <> &Состояние";
		
		Запрос.УстановитьПараметр("ДатаСреза", Дата);
		Запрос.УстановитьПараметр("Состояние", ПредопределенноеЗначение("Перечисление.ДвижениеКонтрольныхЗнаков.Поступление"));
		Запрос.УстановитьПараметр("ТЗКонтрольныхЗнаков", ТЗКонтрольныхЗнаков);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Возврат Ложь;
		КонецЦикла;
		Возврат Истина;
		
	КонецФункции	
	
	
	Функция ПроверкаКонтрольныхЗнаков()
		
		// Формирование ТЗ контрольных знаков
		ТЗКонтрольныхЗнаков = Новый ТаблицаЗначений;
		ТЗКонтрольныхЗнаков.Колонки.Добавить("Серия", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(3)));
		ТЗКонтрольныхЗнаков.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число"));
		Для Каждого ТекСтрокаКонтрольныеЗнаки Из КонтрольныеЗнаки Цикл
			Для НомерКонтрольногоЗнака = ТекСтрокаКонтрольныеЗнаки.НачальныйНомер По ТекСтрокаКонтрольныеЗнаки.КонечныйНомер Цикл
				СтрокаТЗК = ТЗКонтрольныхЗнаков.Добавить();
				СтрокаТЗК.Серия = ТекСтрокаКонтрольныеЗнаки.Серия;
				СтрокаТЗК.Номер = НомерКонтрольногоЗнака;
			КонецЦикла; 
		КонецЦикла;
		
		Движения.ОстаткиКЗ.Записывать = Истина;
		ИтогПроверкиТаблицыКЗ = ПроверкаКоличестваКонтрольныхЗнаков(КонтрольныеЗнаки, СырьеИМатериалы);
		Если ИтогПроверкиТаблицыКЗ <> "Не содержит КЗ" и ИтогПроверкиТаблицыКЗ <> "Всё ОК" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Ошибка заполнения таблицы контрольных знаков. " + ИтогПроверкиТаблицыКЗ;
			Сообщение.Сообщить();
			Возврат Истина;
		КонецЕсли; 
		
		НайденоКЗВБазе = ПроверкаНаличияКонтрольныхЗнаков(ТЗКонтрольныхЗнаков);
		Если НайденоКЗВБазе < КонтрольныеЗнаки.Итог("Количество") Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Несколько (" + Строка(КонтрольныеЗнаки.Итог("Количество") - НайденоКЗВБазе) +  ") контрольных знаков не найдено в базе";
			Сообщение.Сообщить();
			Возврат Истина;
		КонецЕсли;
		
		Если Не ПроверкаПовторногоИспользованияКонтрольныхЗнаков(ТЗКонтрольныхЗнаков) Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Найдено повторное использование контрольных знаков";
			Сообщение.Сообщить();
			Возврат Истина;
		КонецЕсли;
		Возврат Ложь;
	КонецФункции
	
	
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		// регистр ОстаткиКЗ
		Если СписыватьКЗ Тогда
			Отказ =  ПроверкаКонтрольныхЗнаков();
			Для Каждого ТекСтрокаКонтрольныеЗнаки Из КонтрольныеЗнаки Цикл
				Для НомерКонтрольногоЗнака = ТекСтрокаКонтрольныеЗнаки.НачальныйНомер По ТекСтрокаКонтрольныеЗнаки.КонечныйНомер Цикл
					Движение = Движения.ОстаткиКЗ.Добавить();
					Движение.Период = Дата;
					Движение.Серия = ТекСтрокаКонтрольныеЗнаки.Серия;
					Движение.Номер = НомерКонтрольногоЗнака;
					Движение.Состояние = ТекСтрокаКонтрольныеЗнаки.ПричинаСписания;
					Движение.Продукция = ВидПродукции;
					Движение.Комментарий = Комментарий;
				КонецЦикла; 
			КонецЦикла;
		КонецЕсли; 
		
		// регистр Остатки Приход
		Движения.Остатки.Записывать = Истина;
		Для Каждого ТекСтрокаЭтапыПроизводства Из ЭтапыПроизводства Цикл
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ВидПродукции;
			Движение.Склад = СкладПоступленияПродукции;
			Движение.Количество = ТекСтрокаЭтапыПроизводства.КоличествоВыпуска;
			Если ВидПродукции.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материалы ИЛИ ВидПродукции.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Сырье ИЛИ ВидПродукции.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Полуфабрикаты Тогда
				
			Иначе
				Если ДляМасла И Не ДатаРозлива = '00010101000000' Тогда
					Движение.ДатаВыпуска = ДатаРозлива;
				Иначе 
					Движение.ДатаВыпуска = Дата;
				КонецЕсли; 
				Движение.НомерПартии = НомерПартии;
			КонецЕсли;
			
		КонецЦикла;
		
		// регистр Остатки Расход
		Движения.Остатки.Записывать = Истина;
		Для Каждого ТекСтрокаСырьеИМатериалы Из СырьеИМатериалы Цикл
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаСырьеИМатериалы.Номенклатура;
			Движение.Склад = СкладСписанияСырья;
			Движение.Количество = ТекСтрокаСырьеИМатериалы.Количество;
		КонецЦикла;
		
		// регистр Остатки Приход
		Движения.Остатки.Записывать = Истина;
		Для Каждого ТекСтрокаВозвратныеОтходы Из ВозвратныеОтходы Цикл
			Движение = Движения.Остатки.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаВозвратныеОтходы.Наименование;
			Движение.Склад = СкладСписанияСырья;
			Движение.Количество = ТекСтрокаВозвратныеОтходы.Количество;
		КонецЦикла;
		
		#Если Не МобильноеПриложениеСервер Тогда
			// регистр Управленческий 
			Движения.Управленческий.Записывать = Истина;
			Для Каждого ТекСтрокаСырьеИМатериалы Из СырьеИМатериалы Цикл
				Движение = Движения.Управленческий.Добавить();
				Движение.СчетДт = ПланыСчетов.Основной.ОсновноеПроизводство;
				Движение.СчетКт = ПланыСчетов.Основной.СырьеИМатериалы;
				Движение.Период = Дата;
				Движение.КоличествоКт = ТекСтрокаСырьеИМатериалы.Количество;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ТекСтрокаСырьеИМатериалы.Номенклатура;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.МестаХранения] = СкладСписанияСырья;
				Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Сотрудники] = СкладСписанияСырья;
			КонецЦикла;
			
			// регистр Управленческий 
			Движения.Управленческий.Записывать = Истина;
			Для Каждого ТекСтрокаЭтапыПроизводства Из ЭтапыПроизводства Цикл
				Движение = Движения.Управленческий.Добавить();
				Движение.СчетДт = ПланыСчетов.Основной.ГотоваяПродукция;
				Движение.СчетКт = ПланыСчетов.Основной.ОсновноеПроизводство;
				Движение.Период = Дата;
				Движение.КоличествоДт = ТекСтрокаЭтапыПроизводства.КоличествоВыпуска;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = ВидПродукции;
				Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.МестаХранения] = СкладПоступленияПродукции;
			КонецЦикла;
		#КонецЕсли
		
		Если ОбработкаСуммыКоличества(Ссылка) >= ПланируемоеКоличество Тогда
			Статус = Перечисления.СтатусПроизводства.Окончено;
		ИначеЕсли Статус = Перечисления.СтатусПроизводства.Запланировано Тогда
			Статус = Перечисления.СтатусПроизводства.Запланировано;
		Иначе 
			Статус = Перечисления.СтатусПроизводства.Начато;
		КонецЕсли;
		
		Записать();	
		
	КонецПроцедуры
	
#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли

#КонецОбласти
